#include "image.h"
#include <stdlib.h>

main(int ac,char *av[])
{
	ImageData *img,*outimg;
	int res;
	int x,y,mx,my;

	if(ac<3) {
		printf("パラメータが足りません");
		return;
	}

	// ファイルより画像データの読み込み
	res=readBMPfile(av[1],&img);
	if(res<0) {
		printf("画像が読めません");
		return;
	}

	// 結果格納用画像データ作成
	outimg=createImage(img->width,img->height,24);
	
	effect(img,outimg);

	writeBMPfile(av[2],outimg);
	disposeImage(img);
	disposeImage(outimg);

}

// エフェクト処理
int effect(ImageData *img,ImageData *outimg)
{
	int x,y;
	int val;
	int rr,gg,bb;
	int adr;
	Pixel col;
int dith[256]={
	  1,129, 33,161,  9,137, 41,169,  3,131, 35,163, 11,139, 43,171,
	193, 65,225, 97,201, 73,233,105,195, 67,227, 99,203, 75,235,107,
	 49,177, 17,145, 57,185, 25,153, 51,179, 19,147, 59,187, 27,155,
	241,113,209, 81,249,121,217, 89,243,115,211, 83,251,123,219, 91,
	 13,141, 45,173,  5,133, 37,165, 15,143, 47,175,  7,135, 39,167,
	205, 77,237,109,197, 69,229,101,207, 79,239,111,199, 71,231,103,
	 61,189, 29,157, 53,181, 21,149, 63,191, 31,159, 55,183, 23,151,
	253,125,221, 93,245,117,213, 85,255,127,223, 95,247,119,215, 87,
	  4,132, 36,164, 12,140, 44,172,  2,130, 34,162, 10,138, 42,170,
	196, 68,228,100,204, 76,236,108,194, 66,226, 98,202, 74,234,106,
	 52,180, 20,148, 60,188, 28,156, 50,178, 18,146, 58,186, 26,154,
	244,116,212, 84,252,124,220, 92,242,114,210, 82,250,122,218, 90,
	 16,144, 48,176,  8,136, 40,168, 14,142, 46,174,  6,134, 38,166,
	208, 80,240,112,200, 72,232,104,206, 78,238,110,198, 70,230,102,
	 64,192, 32,160, 56,184, 24,152, 62,190, 30,158, 54,182, 22,150,
	255,128,224, 96,248,120,216, 88,254,126,222, 94,246,118,214, 86
};

	for(y=0;y<img->height;y++) {
		for(x=0;x<img->width;x++) {
			val = getPixel(img,x,y,&col);	//画像上の画素情報を取得
			rr=col.r;
			gg=col.g;
			bb=col.b;
			adr=(x%16)+(y%16)*16;
			if(rr<dith[adr]) rr=0;
			else rr=255;
			if(gg<dith[adr]) gg=0;
			else gg=255;
			if(bb<dith[adr]) bb=0;
			else bb=255;
			col.r = rr;
			col.g = gg;
			col.b = bb;
			setPixel(outimg,x,y,&col);	// 画像に値をセットする
		}
	}
	return TRUE;
}
